My_Rails_Apps/movie_app/app/views/movies/index.html.erb

SELECT "movies".* FROM "movies"
---
<ul>
<% Movies.all.each do |x| %>