My_Rails_Apps/movie_app/app/controllers/movies_controller.rb

  def search #Displays search results and also allows user to search again.
    @movie = Movie.new
    @movies = Movie.search params[:movie][:title]
---
SELECT "movies".* FROM "movies" WHERE (title LIKE '%star%' OR description LIKE '%star%' OR year_released LIKE '%star%' OR rating LIKE '%star%')

  def create #Creates the actual movie and saves it to the database if it meets the validations.
    @movie = Movie.new movie_params

    if @movie.save #If it can save, redirects to movie path, otherwise renders new page again (and errors are displayed)
---
INSERT INTO "movies" ("created_at", "description", "rating", "title", "updated_at", "year_released") VALUES (?, ?, ?, ?, ?, ?)

  def show #The action for showing a particular movie.
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit #The action for editing a particular movie.
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "11"]]

  def update #The actual code for updating the edited movie.
    @movie = Movie.update(params[:id], movie_params)
---
UPDATE "movies" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "WORK HOLY SHIT"], ["description", "WORK HOLY SHITWORK HOLY SHITWORK HOLY SHIT"], ["updated_at", Sat, 29 Jun 2013 21:27:22 UTC +00:00]]

  def all #Action for showing the entire database.
    @movie = Movie.new
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"